## Code Challenge v2.11

Load the SQL module for Jupyter Notebook and connect to the local database

In [2]:
%load_ext sql
%sql postgresql://postgres:{mypassword}@localhost:5432/BrainTree_SQL_Coding_Challenge_Data_Analyst

Set a limit on the number of rows displayed in query results.

In [3]:
%config SqlMagic.displaylimit = 20

In [4]:
%%sql
select * from continent_map
where country_code is null;

Running query in 'postgresql://postgres:***@localhost:5432/BrainTree_SQL_Coding_Challenge_Data_Analyst'

4 rows affected.

+--------------+----------------+
| country_code | continent_code |
+--------------+----------------+
|     None     |       OC       |
|     None     |       AS       |
|     None     |       AS       |
|     None     |       AS       |
+--------------+----------------+

## 1. Data Integrity Checking & Cleanup

Alphabetically list all of the country codes in the `continent_map` table that appear more than once. Display any values where `country_code` is null as `country_code` = "FOO" and make this row appear first in the list, even though it should alphabetically sort to the middle. Provide the results of this query as your answer.

In [5]:
%%sql
SELECT COALESCE(country_code, 'FOO') AS country_code
FROM continent_map
GROUP BY country_code
HAVING COUNT(*) >1
ORDER BY CASE WHEN country_code IS NULL THEN 1 ELSE 2 END, country_code;

Running query in 'postgresql://postgres:***@localhost:5432/BrainTree_SQL_Coding_Challenge_Data_Analyst'

1 rows affected.

+--------------+
| country_code |
+--------------+
|     FOO      |
+--------------+

For all countries that have multiple rows in the continent_map table, delete all multiple records leaving only the 1 record per country. The record that you keep should be the first one when sorted by the continent_code alphabetically ascending. Provide the query/ies and explanation of step(s) that you follow to delete these records.

In [6]:
%%sql
SELECT country_code,continent_code, ROW_NUMBER()  OVER (PARTITION BY country_code ORDER BY continent_code) as country_num
FROM continent_map
ORDER BY country_code

Running query in 'postgresql://postgres:***@localhost:5432/BrainTree_SQL_Coding_Challenge_Data_Analyst'

254 rows affected.

+--------------+----------------+-------------+
| country_code | continent_code | country_num |
+--------------+----------------+-------------+
|     ABW      |       NA       |      1      |
|     AFG      |       AS       |      1      |
|     AGO      |       AF       |      1      |
|     AIA      |       NA       |      1      |
|     ALA      |       EU       |      1      |
|     ALB      |       EU       |      1      |
|     AND      |       EU       |      1      |
|     ANT      |       NA       |      1      |
|     ARE      |       AS       |      1      |
|     ARG      |       SA       |      1      |
|     ARM      |       AF       |      1      |
|     ASM      |       OC       |      1      |
|     ATA      |       AN       |      1      |
|     ATF      |       AN       |      1      |
|     ATG      |       NA       |      1      |
|     AUS      |       OC       |      1      |
|     AUT      |       EU       |      1      |
|     AZE      |       AS       |      1      |
|     BDI      |       AF       |      1      |
|     BEL      |       EU       |      1      |
+--------------+----------------+-------------+

In [7]:
%%sql
WITH temp_table AS(
    SELECT country_code,continent_code, 
           ROW_NUMBER()  OVER (PARTITION BY country_code ORDER BY continent_code) as country_num
    FROM continent_map
)
DELETE FROM continent_map
WHERE (country_code, continent_code) IN(
    SELECT country_code, continent_code
    FROM temp_table
    WHERE country_num >1
);

Running query in 'postgresql://postgres:***@localhost:5432/BrainTree_SQL_Coding_Challenge_Data_Analyst'

## 2. List the countries ranked 10-12 in each continent by the percent of year-over-year growth descending from 2011 to 2012.

The percent of growth should be calculated as: ((2012 gdp - 2011 gdp) / 2011 gdp)

The list should include the columns:

* rank
* continent_name
* country_code
* country_name
* growth_percent

In [8]:
%%sql
WITH step_1 AS( 
    -- Fetch gdp_per_capita and  gdp_per_capita_next (for 2011 and 2012 years) for each country
    SELECT country_code, year, gdp_per_capita,
        LEAD(gdp_per_capita) OVER(PARTITION BY country_code ORDER BY year) as gdp_per_capita_next
    FROM per_capita
    WHERE year IN (2011,2012) AND gdp_per_capita IS NOT NULL
    ),
    step_2 AS(
    -- Calculate the year-over-year growth percent
    SELECT country_code, ROUND(100*(gdp_per_capita_next - gdp_per_capita)/gdp_per_capita, 2) as growth_percent
    FROM step_1
    WHERE gdp_per_capita_next IS NOT NULL
    ),
    step_3 AS(
    -- Join data to retrieve continent_name, country_name and rank by growth_percent
    SELECT continent_name, step_2.country_code, country_name, growth_percent,
        DENSE_RANK() OVER(PARTITION BY continent_name ORDER BY growth_percent DESC) as rank
    FROM step_2 JOIN
        continent_map USING (country_code) JOIN
        continents ON continents.continents = continent_map.continent_code JOIN
        countries ON  step_2.country_code = countries.country_code   
    )
-- Fetch countries ranked 10-12 by growth_percent for each continent
SELECT continent_name, country_code, country_name, CONCAT(growth_percent, '%'), rank
FROM step_3
WHERE rank BETWEEN 10 AND 12
ORDER BY 1, 5, 2

Running query in 'postgresql://postgres:***@localhost:5432/BrainTree_SQL_Coding_Challenge_Data_Analyst'

19 rows affected.

+----------------+--------------+---------------------+--------+------+
| continent_name | country_code |     country_name    | concat | rank |
+----------------+--------------+---------------------+--------+------+
|     Africa     |     RWA      |        Rwanda       | 8.73%  |  10  |
|     Africa     |     GIN      |        Guinea       | 8.32%  |  11  |
|     Africa     |     NGA      |       Nigeria       | 8.09%  |  12  |
|      Asia      |     UZB      |      Uzbekistan     | 11.12% |  10  |
|      Asia      |     IRQ      |         Iraq        | 10.06% |  11  |
|      Asia      |     PHL      |     Philippines     | 9.73%  |  12  |
|     Europe     |     MNE      |      Montenegro     | -2.93% |  10  |
|     Europe     |     SWE      |        Sweden       | -3.02% |  11  |
|     Europe     |     ISL      |       Iceland       | -3.84% |  12  |
| North America  |     GTM      |      Guatemala      | 2.71%  |  10  |
| North America  |     HND      |       Honduras      | 2.71%  |  10  |
| North America  |     ATG      | Antigua and Barbuda | 2.52%  |  11  |
| North America  |     SLV      |     El Salvador     | 2.46%  |  12  |
|    Oceania     |     FJI      |         Fiji        | 3.29%  |  10  |
|    Oceania     |     TUV      |        Tuvalu       | 1.27%  |  11  |
|    Oceania     |     KIR      |       Kiribati      | 0.04%  |  12  |
| South America  |     ARG      |      Argentina      | 5.67%  |  10  |
| South America  |     PRY      |       Paraguay      | -3.62% |  11  |
| South America  |     BRA      |        Brazil       | -9.83% |  12  |
+----------------+--------------+---------------------+--------+------+

## 3. For the year 2012, create a 3 column, 1 row report showing the percent share of gdp_per_capita for the following regions:

(i) Asia, (ii) Europe, (iii) the Rest of the World. Your result should look something like

Asia	Europe	Rest of World
25.0%	25.0%	50.0%

In [9]:
%%sql
--Sum the GDP per capita for Asia, Europe, and the rest of the world for the year 2012
WITH step_1 AS(
    SELECT SUM(CASE WHEN continent_name = 'Asia' THEN gdp_per_capita ELSE 0 END) AS asia,
           SUM(CASE WHEN continent_name = 'Europe' THEN gdp_per_capita ELSE 0 END) AS europe,
           SUM(CASE WHEN continent_name NOT IN ('Asia', 'Europe') THEN gdp_per_capita ELSE 0 END) AS rest_of_the_world
    FROM per_capita pc JOIN
        continent_map cm ON pc.country_code = cm.country_code 
        -- Filter for the year 2012 and exclude rows with NULL GDP per capita
        AND pc.year = 2012 
        AND pc.gdp_per_capita IS NOT NULL JOIN
        continents c ON cm.continent_code = c.continents 
    )
-- Calculate the percentage share for each region and format the result as percentages
SELECT  CONCAT(ROUND(100*asia/(asia + europe + rest_of_the_world),2), '%') AS asia,
        CONCAT(ROUND(100*europe/(asia + europe + rest_of_the_world),2), '%') AS europe,
        CONCAT(ROUND(100*rest_of_the_world/(asia + europe + rest_of_the_world),2), '%') AS rest_of_the_world
FROM step_1

Running query in 'postgresql://postgres:***@localhost:5432/BrainTree_SQL_Coding_Challenge_Data_Analyst'

1 rows affected.

+--------+--------+-------------------+
|  asia  | europe | rest_of_the_world |
+--------+--------+-------------------+
| 28.33% | 42.24% |       29.43%      |
+--------+--------+-------------------+

## 4a. What is the count of countries and sum of their related gdp_per_capita values for the year 2007 where the string 'an' (case insensitive) appears anywhere in the country name?

In [10]:
%%sql
SELECT COUNT(country_name) AS count_country,
       CONCAT('$',ROUND(SUM(gdp_per_capita),2)) as sum_gdp
FROM per_capita JOIN
     countries USING (country_code)
-- Filter for the year 2007 and match 'an' in the country name (case-insensitive)
WHERE year = 2007 AND country_name ILIKE '%an%'

Running query in 'postgresql://postgres:***@localhost:5432/BrainTree_SQL_Coding_Challenge_Data_Analyst'

1 rows affected.

+---------------+-------------+
| count_country |   sum_gdp   |
+---------------+-------------+
|       68      | $1022936.33 |
+---------------+-------------+

## 4b. Repeat question 4a, but this time make the query case sensitive.

In [11]:
%%sql
SELECT COUNT(country_name) AS count_country,
       CONCAT('$',ROUND(SUM(gdp_per_capita),2)) as sum_gdp
FROM per_capita JOIN
     countries USING (country_code)
-- Filter for the year 2007 and match 'an' in the country name (case-sensitive)
WHERE year = 2007 AND country_name LIKE '%an%'

Running query in 'postgresql://postgres:***@localhost:5432/BrainTree_SQL_Coding_Challenge_Data_Analyst'

1 rows affected.

+---------------+------------+
| count_country |  sum_gdp   |
+---------------+------------+
|       66      | $979600.72 |
+---------------+------------+

## 5. Find the sum of gpd_per_capita by year and the count of countries for each year that have non-null gdp_per_capita where (i) the year is before 2012 and (ii) the country has a null gdp_per_capita in 2012. Your result should have the columns:

* year
* country_count
* total

In [12]:
%%sql
WITH step_1 AS(
    SELECT country_code
    FROM per_capita
    WHERE year = 2012 AND gdp_per_capita IS NULL
    )
SELECT year, COUNT(country_code) as country_count, CONCAT('$',ROUND(SUM(gdp_per_capita),2)) AS total
FROM per_capita
WHERE year < 2012 
      AND gdp_per_capita IS NOT NULL 
      AND country_code IN(SELECT country_code FROM step_1)
GROUP BY year
ORDER BY year;

Running query in 'postgresql://postgres:***@localhost:5432/BrainTree_SQL_Coding_Challenge_Data_Analyst'

8 rows affected.

+------+---------------+------------+
| year | country_count |   total    |
+------+---------------+------------+
| 2004 |       15      | $491203.19 |
| 2005 |       15      | $510734.98 |
| 2006 |       14      | $553689.64 |
| 2007 |       14      | $654508.77 |
| 2008 |       10      | $574016.21 |
| 2009 |       9       | $473103.33 |
| 2010 |       4       | $179750.83 |
| 2011 |       4       | $199152.68 |
+------+---------------+------------+

## 6. All in a single query, execute all of the steps below and provide the results as your final answer:

a. create a single list of all per_capita records for year 2009 that includes columns:
* continent_name
* country_code
* country_name
* gdp_per_capita 

b. order this list by:
* continent_name ascending
* characters 2 through 4 (inclusive) of the country_name descending

c. create a running total of gdp_per_capita by continent_name

d. return only the first record from the ordered list for which each continent's running total of gdp_per_capita meets or exceeds $70,000.00 with the following columns:

* continent_name
* country_code
* country_name
* gdp_per_capita
* running_total

In [13]:
%%sql
-- Step 1: Create a CTE to calculate the running total of GDP per capita for each continent
WITH step_1 AS(
   SELECT continent_name, countries.country_code, country_name, gdp_per_capita, SUBSTRING(country_name,2,3),
       SUM(gdp_per_capita) OVER(PARTITION BY continent_name ORDER BY SUBSTRING(country_name,2,3) DESC, country_name) AS running_total
       -- Computes a running total of GDP per capita partitioned by continent and ordered by the substring of country_name and country_name itself.
       -- If two countries have the same substring, they are then ordered by the full country name in ascending order.
       -- This extra ordering ensures consistent and specific ordering when calculating the running total.
   FROM per_capita JOIN
          countries ON per_capita.country_code = countries.country_code JOIN
          continent_map ON countries.country_code = continent_map.country_code JOIN
          continents ON continent_map.continent_code = continents.continents 
          AND year = 2009 -- Filters for the year 2009
        ),
-- Step 2: Create a second CTE to assign a rank to each country based on their running total of GDP per capita
      step_2 AS(
   SELECT continent_name, country_code, country_name, gdp_per_capita, running_total,
         ROW_NUMBER() OVER(PARTITION BY continent_name ORDER BY running_total) as rnk
   FROM step_1
   WHERE running_total >= 70000
      )
-- Final query: Select the country with the smallest running total per continent that exceeds or equals 70,000
SELECT continent_name, country_code, country_name, CONCAT('$', ROUND(gdp_per_capita,2)) AS gdp_per_capita, CONCAT('$', ROUND(running_total,2)) AS running_total
FROM step_2
WHERE rnk = 1 -- Select the country ranked 1 (the one with the smallest running total >= 70,000)

Running query in 'postgresql://postgres:***@localhost:5432/BrainTree_SQL_Coding_Challenge_Data_Analyst'

6 rows affected.

+----------------+--------------+--------------+----------------+---------------+
| continent_name | country_code | country_name | gdp_per_capita | running_total |
+----------------+--------------+--------------+----------------+---------------+
|     Africa     |     LBY      |    Libya     |   $10455.57    |   $70227.16   |
|      Asia      |     KWT      |    Kuwait    |   $37160.54    |   $73591.81   |
|     Europe     |     CHE      | Switzerland  |   $65790.07    |   $84673.58   |
| North America  |     ABW      |    Aruba     |   $24639.94    |   $84504.67   |
|    Oceania     |     NZL      | New Zealand  |   $27474.33    |   $84623.92   |
| South America  |     ECU      |   Ecuador    |    $4236.78    |   $72315.82   |
+----------------+--------------+--------------+----------------+---------------+

## 7. Find the country with the highest average gdp_per_capita for each continent for all years. Now compare your list to the following data set. Please describe any and all mistakes that you can find with the data set below. Include any code that you use to help detect these mistakes.

| rank | continent_name | country_code | country_name | avg_gdp_per_capita |
|:-----|:---------------|:-------------|:-------------|:-------------------|
|1     |Africa          |SYC           |Seychelles    |$11,348.66          |
|1     |Asia            |KWT           |Kuwait        |$43,192.49          |
|1     |Europe          |MCO           |Monaco        |$152,936.10         |
|1     |North America   |BMU           |Bermuda       |$83,788.48          |
|1     |Oceania         |AUS           |Australia     |$47,070.9           |
|1     |South America   |CHL           |Chile         |$10,781.71          |

In [14]:
%%sql
WITH step_1 AS(
     SELECT continent_name, country_name, countries.country_code,  ROUND(AVG(gdp_per_capita),2) AS avg_gdp
     FROM per_capita JOIN
          countries ON per_capita.country_code = countries.country_code JOIN
          continent_map ON countries.country_code = continent_map.country_code JOIN
          continents ON continent_map.continent_code = continents.continents
     GROUP BY continent_name, country_name, countries.country_code
     ),
     step_2 AS(
     SELECT continent_name, country_name, country_code, avg_gdp,
          RANK() OVER(PARTITION BY continent_name ORDER BY avg_gdp DESC) as rank
     FROM step_1
     )
SELECT rank, continent_name, country_name, country_code, CONCAT('$',avg_gdp) AS avg_gdp_per_capita
FROM step_2
WHERE rank = 1

Running query in 'postgresql://postgres:***@localhost:5432/BrainTree_SQL_Coding_Challenge_Data_Analyst'

6 rows affected.

+------+----------------+-------------------+--------------+--------------------+
| rank | continent_name |    country_name   | country_code | avg_gdp_per_capita |
+------+----------------+-------------------+--------------+--------------------+
|  1   |     Africa     | Equatorial Guinea |     GNQ      |     $17955.72      |
|  1   |      Asia      |       Qatar       |     QAT      |     $70567.96      |
|  1   |     Europe     |       Monaco      |     MCO      |     $151421.89     |
|  1   | North America  |      Bermuda      |     BMU      |     $84634.83      |
|  1   |    Oceania     |     Australia     |     AUS      |     $46147.45      |
|  1   | South America  |       Chile       |     CHL      |     $10781.71      |
+------+----------------+-------------------+--------------+--------------------+